In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import sqlalchemy as sa

from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score,mean_absolute_error,mean_squared_error

ipykernel needs to be installed to run jupyter notebooks in our env

## Data Gathering

In [3]:
# Data Gathering
## create_engine(rdbms+pymysql://userName:password@hostName:portnumber/db_name)
engine=sa.create_engine('mysql+pymysql://root:Matrixreloaded1@localhost:3306/emp')
engine

Engine(mysql+pymysql://root:***@localhost:3306/emp)

In [4]:
df = pd.read_sql(" select * from titanic ",engine)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S

## EDA

In [5]:
# EDA
df.info()
# There are no null values in any column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Survived     714 non-null    int64
 2   Pclass       714 non-null    int64
 3   Name         714 non-null    object
 4   Sex          714 non-null    object
 5   Age          714 non-null    int64
 6   SibSp        714 non-null    int64
 7   Parch        714 non-null    int64
 8   Ticket       714 non-null    object
 9   Fare         714 non-null    float64
 10  Cabin        714 non-null    object
 11  Embarked     714 non-null    object
dtypes: float64(1), int64(6), object(5)
memory usage: 67.1+ KB

In [6]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [7]:
df.shape

(714, 12)

In [8]:
df.dtypes[df.dtypes==object]
# These need to be converted into numerical dtype
# we can drop Naae and Ticket and Cabin as they are non categorical and  does not impact prediction

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [9]:
df.drop(columns=['Ticket','Cabin','PassengerId','Name'],inplace=True)

In [10]:
df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

Converting categrical columns to numerical

1. Sex

In [11]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [12]:
df['Sex'].value_counts()

male      453
female    261
Name: Sex, dtype: int64

In [13]:
df['Sex'].replace({'male':0,'female':1},inplace=True)

In [14]:
df['Sex'].value_counts()

0    453
1    261
Name: Sex, dtype: int64

2. Embarked

In [15]:
df['Embarked'].unique()

array(['S', 'C', 'Q', ''], dtype=object)

In [16]:
df['Embarked'].value_counts()

S    554
C    130
Q     28
       2
Name: Embarked, dtype: int64

In [17]:
df[df['Embarked']=='']

     Survived  Pclass  Sex  Age  SibSp  Parch  Fare Embarked
46          1       1    1   38      0      0  80.0
662         1       1    1   62      0      0  80.0

In [18]:
df['Embarked'].mode()[0]

'S'

In [21]:
df['Embarked'].iloc[[46,662]] = 'S'
# filling missing values with mode

C:\Users\saura\AppData\Local\Temp\ipykernel_20664\3509024676.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Embarked'].iloc[[46,662]] = 'S'

In [22]:
df['Embarked'].value_counts().to_dict()

{'S': 556, 'C': 130, 'Q': 28}

In [23]:
#one hot encoding
df = pd.get_dummies(df,columns=['Embarked'])

In [24]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,0,3,0,22,1,0,7.2500,0,0,1
1,1,1,1,38,1,0,71.2833,1,0,0
2,1,3,1,26,0,0,7.9250,0,0,1
3,1,1,1,35,1,0,53.1000,0,0,1
4,0,3,0,35,0,0,8.0500,0,0,1

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    714 non-null    int64
 1   Pclass      714 non-null    int64
 2   Sex         714 non-null    int64
 3   Age         714 non-null    int64
 4   SibSp       714 non-null    int64
 5   Parch       714 non-null    int64
 6   Fare        714 non-null    float64
 7   Embarked_C  714 non-null    uint8
 8   Embarked_Q  714 non-null    uint8
 9   Embarked_S  714 non-null    uint8
dtypes: float64(1), int64(6), uint8(3)
memory usage: 41.3 KB

In [26]:
df.to_csv('titanic_train.csv',index=False)

In [38]:
encoded_dict = {}

In [39]:
from sqlalchemy import column


df.drop(columns=['Survived']).columns.to_list()

['Pclass',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Fare',
 'Embarked_C',
 'Embarked_Q',
 'Embarked_S']

In [40]:
encoded_dict.update({'columns':df.drop(columns=['Survived']).columns.to_list()})
encoded_dict

{'columns': ['Pclass',
  'Sex',
  'Age',
  'SibSp',
  'Parch',
  'Fare',
  'Embarked_C',
  'Embarked_Q',
  'Embarked_S']}

In [41]:
encoded_dict.update({'sex':{'male':0,'female':1}})
encoded_dict

{'columns': ['Pclass',
  'Sex',
  'Age',
  'SibSp',
  'Parch',
  'Fare',
  'Embarked_C',
  'Embarked_Q',
  'Embarked_S'],
 'sex': {'male': 0, 'female': 1}}

In [33]:
import json

with open('encoder.json','w') as f:
    json.dump(encoded_dict,f)